{"text":"Center for Management of Information Technologies. Contect information. http://www.cc.kumamoto-u.ac.jp/en/contact"}
{"text":"Center for Management of Information Technologies. Web page address: URL: http://www.cc.kumamoto-u.ac.jp/en"}
{"text":"The web page address of the Kumamoto University is https://ewww.kumamoto-u.ac.jp/en/."}
{"text":"The web page address of the Moodle Kumamoto University is https://md.kumamoto-u.ac.jp/."}
{"text":"The address Center for Management of Information Technologies webpage is https://ewww.kumamoto-u.ac.jp/en/centers/centers/multimedia/ ."}
{"text":"The Center for Management of Information Technologies was established as the central organization to organically integrate the university computer systems and info-communication networks."}
{"text":"Visit the login page of the Kumamoto University the Kumamoto University Integrated Authentication System. and type your Kumamoto University ID and password."}
{"text":"Access Kumamoto University's Portal website (http://uportal.kumamoto-u.ac.jp/) and log on to site by entering your Kumadai ID and password. Your Student number and password are written on the back of your Student ID."}
{"text":"When you browse SOSEKI please use the personal computer which is connected to Kumamoto University's LAN. Accessing SOSEKI is available only in school."}
{"text":"The publications of Kita Toshihiro can be found on the Research Gate https://www.researchgate.net/scientific-contributions/Toshihiro-Kita-82040055 ."}
{"text":"The Kumamoto University offers courses for international students. Please visit the webpage of the Kumamoto University International Students Office."}
{"text":"Where can I find the International Students Office? You can find Kumamoto University International Students Office on the Facebook."}
{"text":"Toshihiro Kita's research publications are on this web page https://www.gsis.kumamoto-u.ac.jp/en/professors/toshihiro-kita/ ."}
{"text":"Kumamoto University provides an e-Learning program for local citizens called as 'e-Learning Station'."}
{"text":"The mission of Center for Management of Information Technologies is to use information technology to improve education and research at Kumamoto University. To achieve this we research information processing provide help with information-related research and educate on information literacy. We also provide operate and maintain computer and network equipment at Kumamoto University. "}
{"text":"The VPN (Virtual Private Network) system introduced by the center in fiscal 2003 will start full-scale operation in fiscal 2004. This document will provide an overview of the VPN system, and an explanation of installing onto client PCs the software that is required in order to use the VPN system. "}
{"text":"What is a VPN system? Broadband connections such as FTTH (fiber optic), ADSL (telephone lines), and CATV (cable television) are now widespread in homes, and many students want to be able to use from their homes services such as the SOSEKI system, which are restricted to use from within the university. This university-only system handles information that has high levels of security, and is thus restricted to use from within the university. Accordingly, access to this system over the Internet, which can be accessed by people around the world, shall not be permitted in principle."}
{"text":"What is a VPN system? In these circumstances, a technology called VPN (Virtual Private Network) can be used. This is a mechanism with which encryption technology is used to create a virtual network over another network, which can include the Internet. Using this technology enables the following. When you have a contract with an Internet service provider in order to connect your home computers to the Internet, these computers become a part of the ISP's network. In these cases, by using a VPN to connect your home PC to the KUIC network at Kumamoto University, it is possible to make it appear that your computer is directly connected to KUIC from a computer on campus, in spite of it actually being connected over the Internet."}
{"text":"VPN system. For this to occur, equipment and software in order to create the VPN are required on each network. To this end, the center installed dedicated Cisco VPN 3030 concentrator equipment. In order to connect to this equipment, you need to obtain your own ID, and install dedicated software on your computer. To obtain this ID, you need to use a portion of your school fund to pay for support and maintenance costs. The dedicated software can be obtained from the Center's university-only webpage. At present, supported operating systems are Windows (98, NT, ME, 2000, XP), Mac OSX (10.1.5 or later), and Linux. Installation of this software on different operating systems, and configuration methods are explained below."}
{"text":"Use of this system requires that you carry out procedures to transfer school funds, that you register a user ID, and that you obtain an encryption key and other information. A usage application form can be ordered from the URL detailed below. Please fill in the necessary fields, and send this to the Center Office. When application procedures have been completed, the application form will be returned to you along with information about where to obtain the client software, and information on how it should be configured. "}
{"text":"Wireless LAN (IEEE802.11a/g/b/n) access is provided for all students and university staff in service. For locations of wireless LAN access points, click here."}
{"text":"The Center for Multimedia and Information Technologies (CMIT) comprises the following three sections, as well as a CMIT Laboratory that carries out group research leveraging their unique characteristics."}
{"text":"Computer-Aided Education Research Section (CAERS) We study and develop multimedia-based education and research systems. One example is a distance education system utilizing information-communication technologies."}
{"text":"Media Information Processing Research Section (MIPRS) We study multimedia teaching materials and digitization of academic information. For example, we study how to create, maintain, store, and disseminate academic contents."}
{"text":"Network Communications Research Section (NCRS) We study improving and optimizing information infrastructure, mainly focused on network, for university and local areas. We also cover topics related to network- and information -securities."}
{"text":"CMIT Laboratory Grouped Research Section (CMIT Labo. GRS) This section is an organized section by grouping the above described three research sections, CAERS, MIPRS, and NCRS. We are studying the Basic IT courses, computer environments, network environment, instructional design, and electronic educational materials."}
{"text":"This center, the Center for Multimedia and Information Technologies (CMIT), was establised as the central organization to integrate the university computer systems and info-communication networks organically. Our mission is to develop education and research at Kumamoto University and to promote coordination with the local community through information technology. To achive the mission, we conduct research on information processing, support information-related research, and provide education on information literacy. We also provide, operate, and maintain computers and network equipment in the university."}
{"text":"The first computer room was established in April 1964 as a shared facility on the university campus. Then in August 1986 it was reorganized and became the Data Processing Center. In June 1990, it became a ministry-certified facility named the Information Processing Center. In April 2002 the center was reorganized into three research sections and renamed the Center for Multimedia and Information Technologies."}
{"text":"The three sections are the Computer-Aided Education Research Section (CAERS), the Media Information Processing Research Section (MIPRS), and the Network Communications Research Section (NCRS). The CAERS conducts research and development of multimedia-based computer-aided education systems under the direction of a professor and associate professor. The MIPRS conducts research into the computerization of academic information to build a database and the development of multi-media teaching materials under the direction of a professor and assistant professor. The NCRS conducts research into the advancement and optimization of information infrastructure on campus and in the local community, primarily centered on networks, also under the direction of a professor and associate professor."}
{"text":"As a core of information technology, we will lead informatization of Kumamoto University and the local community. Our research activity is focused on practical research from real-wrold problems rather than research for research's sake. We look forward to your continued participation and support in the achievement of these goals."}
{"text":"Center for Management of Information Technologies, Kumamoto University, Kurokami 2-39-1, Kumamoto City, Kumamoto, Japan. TEL:+81-96-342-3824/FAX:+81-96-342-3829"}
{"text":"Toshihiro Kita Associate Professor, Computer Aided Education Research Section, Center for Multimedia and Information Technologies, Kumamoto University "}
{"text":"Tutor System. Tutors provide educational guidance on an individual basis to international students who have enrolled in Kumamoto University. In addition, international students with limited Japanese ability can ask their tutors for help with aspects of their daily lives."}
{"text":"Kumamoto University has established the Kumamoto University Support Association for International Students in order to support foreign students."}
{"text":"Liaison Office for International Students. International Students Office: 2nd floor of Building A at General Education Building. Graduate School of Science and Technology Academic Section Office:Kurokami South Campus Students Affairs Section, School of Medicine: 3rd floor of Medical Education ＆ Library building"}
{"text":"Consulting Room for Students: 1st floor of General Education Building When you feel depressed/worried about study or human relationships, etc., please feel free to consult with an advisor at the consulting room for students. (*Since it is Japanese language only, you need a translator if you cannot speak/understand Japanese.)"}
{"text":"Health Care Center The Health Care Center at the university provides various types of services so that students can lead comfortable lives. When you feel sick, consult the staff at the Health Care Center. In the case of minor illness andinjures, visit the Center for treatment. The staff there will let you know if you need to go tohospital. Also, a specialized doctor will see students who have mental problems. Doctors from Kumamoto University Hospital are available for special health consultations."}
{"text":"You need to take procedures at Kumamoto City Chuo Ward Office (Citizen Registration, Join the National Health Insurance and National Pension Plan) and open a bank account, etc. Tutors will help you with those procedures. We will talk about what new international students should do/know at the orientation for new international students, new students must join this orientation."}
{"text":"The address of the Kumamoto University: Kumamoto University 2-39-1 Kurokami Chuo-ku Kumamoto 860-8555 JAPAN"}
{"text":"If you are enrolled in Kumamoto University, you are eligible to join Japanese classes. However you are not permitted to study only Japanese (except Japanese intensive course students of embassy recommendation MEXT scholarship)."}
{"text":"Register for classes using the SOSEKI class registration system. In order to access SOSEKI, you need to know the I.D. and initial password written on the back of your student I.D. card. In addition, you can check your class grades using SOSEKI."}
{"text":"When you use the library or computers at Kumamoto University, you need a student ID card. In addition, it is also needed when you want a Certificate of Student Status or an academic transcript issued. Everyone other than foreign exchange students should collect their student ID card at the academic office of their respective departmental/graduate school. Japanese Language Trainees will receive their student ID card at the International Affairs Division."}
{"text":"Request certificates through 'Certificate issuance system' on Kumamoto University's Portal. Certificate of Student Registration: certifies that you are/were a student at Kumamoto University. Transcript: certifies your scholastic performance. Certificate of Future Completion: certifies that you are going to graduate. Medical Examination Certificate: certifies the result of medical examination."}
{"text":"We have a tutor scheme to assist new students at Kumamoto University assimilate to life in Japan as quickly as possible. These tutors would offer living support and study support to international students."}
{"text":"Kumamoto University Health Care Center offers a wide range of medical services from general health care to various specialist services."}
{"text":"What is the Daily Communication Book? Daily Communication Book for Kumamoto University International Students was released to ensure a smooth communication during their stay in Kumamoto, Japan."}
{"text":"Center for Management of Information Technologies. Contect information. http://www.cc.kumamoto-u.ac.jp/en/contact"}
{"text":"Center for Management of Information Technologies. web page address. URL: http://www.cc.kumamoto-u.ac.jp/en"}
{"text":"Kumamoto university email service. We provide email service using the campus-wide GPO (General Post Office) mail server. Permission for use. To use this mail service, submit this form to the center."}
{"text":"Basic configuration of mail client (mail software). The following table shows the basic configuration to use the GPO mail server securely. In the table, we use 'Senta Soujou' as a user name and 'sjsenta@kumamoto-u.ac.jp' as his mail address."}
{"text":"Center for Management of Information Technologies. Services Directory: Network Services, including an E-mail service for generic domain, etc., VPN Service, WLAN System, License Service, Site Licensed Softwares(StartSuite/F-Secure)"}
{"text":"Center for Management of Information Technologies. (CMIT) Services Directory: Online Submission for Site Licensed Softwares, Mathematica, WEB Hosting Services, Kumamoto University Portal (uPortal), Education Serives, WebCT Manual (KU ed.), PC Terminal's Rooms, Kumamoto University, SCS Room"}
{"text":"Center for Management of Information Technologies. campus-wide wireless network. Wireless LAN (IEEE802.11a/g/b/n) access is provided for all students and university staff in service. For locations of wireless LAN access points, click here."}
{"text":"Kumamoto University. Service overview. campus-wide wireless network. Wireless LAN. How to use. Preparations before you start: Ensure you have a computer with wireless LAN (IEEE802.11a/g/b/n) capabilities, or a wireless LAN card. Important notice in usage. Borrowing or lending user names and passwords is strictly prohibited. Multiple-login (using the same account for more than two connections at the same time) is not possible Protect WEP keys, WPA passwords, and personal passwords. Ensure that computers to be connected to the network have had security patches (Windows Update, etc.) applied. Use the network under generally-accepted societal morals and network morals."}
{"text":"Kumamoto. Settings for using the campus-wide wireless LAN base stations. Turn on the wireless function of your computer. See the manual of your wireless LAN card for instructions on how to install the driver (this operation only needs to be done once). Connect to a campus-wide wireless LAN base station. Setting the campus-wide wireless LAN base station name (ESS-ID). Setting the encryption key (WEP Key/WPA password)"}
{"text":"Center for Management of Information Technologies. CMIT. Kumamoto University. http://www.cc.kumamoto-u.ac.jp/en/contact"}
{"text":"Setting up a connection for the campus-wide wireless LAN. Connecting to the network. Open a web browser and access any website. (Even when you only use mail) If you receive an error message at this stage, check the links below: instructions for Firefox. instructions for Internet. When the login window appears, enter your username and password and click the [Logon User] button. Username and password"}
{"text":"Center for Management of Information Technologies. Research and Development Page. The Center for Multimedia and Information Technologies (CMIT) comprises the following three sections, as well as a CMIT Laboratory that carries out group research leveraging their unique characteristics. Overview of Sections. Computer-Aided Education Research Section (CAERS). We study and develop multimedia-based education and research systems. One example is a distance education system utilizing information-communication technologies. Media Information Processing Research Section (MIPRS) We study multimedia teaching materials and digitization of academic information. We study how to create, maintain, store, and disseminate academic contents. Network Communications Research Section (NCRS) We study improving and optimizing information infrastructure, mainly focused on network, for university and local areas. We also cover topics related to network and information securities. CMIT Laboratory Grouped Research Section."}
{"text":"Center for Management of Information Technologies. Research and Development Top Page. One example is a distance education system utilizing information-communication technologies. Media Information Processing Research Section (MIPRS) We study multimedia teaching materials and digitization of academic information. We study how to create, maintain, store, and disseminate academic contents. Network Communications Research Section (NCRS). We study improving and optimizing information infrastructure, mainly focused on network, for university and local areas. We also cover topics related to network- and information -securities. CMIT Laboratory Grouped Research Section (CMIT Labo. GRS). This section is an organized section by grouping the above described three research sections, CAERS, MIPRS, and NCRS. We are studying the Basic IT courses, computer environments, network environment, instructional design, and electronic educational materials."}
{"text":"The three sections are the Computer-Aided Education Research Section (CAERS), the Media Information Processing Research Section (MIPRS), and the Network Communications Research Section (NCRS). The CAERS conducts research and development of multimedia-based computer-aided education systems under the direction of a professor and associate professor. The MIPRS conducts research into the computerization of academic information to build a database and the development of multi-media teaching materials under the direction of a professor and assistant professor. The NCRS conducts research into the advancement and optimization of information infrastructure on campus and in the local community, primarily centered on networks, also under the direction of a professor and associate professor."}
{"text":"As a core of information technology, we will lead informatization of Kumamoto University and the local community. Our research activity is focused on practical research from real-wrold problems rather than research for research's sake. We look forward to your continued participation and support in the achievement of these goals."}
{"text":"Professor　 Toshihiro KITA （Institute for e-Learning Development） kita@ield. CMIT. Kumamoto University."}
{"text":"Demonstration version of App for attempting quizzes in a Moodle course. How to invoke: say 'OK Google, talk to Moodle Quiz' to your Google Home or Google Assistant app. If you are using Amazon Echo, enable Moodle Quiz Skill (currently only for US and AU) and say 'Alexa, open Moodle Quiz' to your Amazon Echo. This version works only for a demo Moodle course as a fixed user login."}
{"text":"New demo command for Google Home: Moodle Quiz. To invoke the command, say 'Talk to Moodle Quiz' to your Google Home or Google Assistant app. This version works only for a demo Moodle course as a fixed user login. English and Japanese are supported now. Only multiple choice questions are supported. I wish I will improve this demo version to enable the linking between Google Home user accounts and Moodle user accounts, which is absolutely necessary for practical use. The video shows how a user interact with Google Home to attempt Moodle quizzes using the demo command:"}
{"text":"Demonstration version of App for attempting quizzes in a Moodle course. See http://tkita.net/ai/moodle_quiz_vui.html for details."}
{"text":"Implementation of Voice User Interfaces to Enhance Users’ Activities on Moodle. VUI. Kita Toshihiro. Dialogflow - Moodle connection."}
{"text":"Voice User Interfaces (VUI) are effective and intuitive for many people. The VUI is rapidly becoming suitable for various practical purposes using voice-operated smartphones, or smart speakers like Amazon Echo or Google Home. If VUIs, which may require less cognitive load to use, are available on learning management systems (LMS) like Moodle, they could enhance LMSs’ functionality. This study demonstrates examples ofexisting educational applications for VUIs and chatbot interfaces. Design suggestions for VUIs for several Moodle activities are also described, and a prototype VUI for Moodle quizzes has been developed with the Dialogflow platform."}
{"text":"PROTOTYPE OF MOODLE. QUIZ ATTEMPTING VUI. We have developed a prototype of a VUI for Moodle Quizzes. Dialogflow (with the webhook feature) was used for prototyping. Communication between Moodle and the Dialogflow agent is done through the webhook script that is invoked by Dialogflow Intents (interaction rules between a user and agent). The webhook script is written in PHP and uses Moodle web service REST API (Moodle.org, 2016), such as ”mod quiz get quizzes by courses” or ”mod quiz start attempt”. The prototype supports multiple-choice questions, and is currently available through Google Home smart speakers (for limited users). Thanks to Dialogflow Integrations’ features, it is also available through Facebook Messenger or other common messaging services that have a chatbot style interface. For the prototype system to work, the Moodle site settings ”Enable web services for mobile devices” and ”Enable web services” must be set to ’Yes.’ The quiz-attempt interaction data is sent to and stored in the M Moodle Quiz attempt history, so the learner is able to review the attempt on the Moodle"}
{"text":"Toshihiro Kita. Articles. Development of a Moodle UI Using LINE Chat for Casual Learning as a Part of a Learner Assistive LMS"}
{"text":"Articles Toshihiro Kita. A Case Study of the University-wide Effects of e-learning Promotion Activities"}
{"text":"Toshihiro Kita. List of articles. Advantages of e-Learning for Citizen Learning Community. A Case of 'Kumamoto Internet Shiminjuku'. Since lifelong learning has become important and information and communication technology using the Internet has been ubiquitous today, we established 'Kumamoto Internet Shiminjuku' Citizen e-learning community in Kumamoto, Japan, which is a lifelong e-learning project by citizens' group. This article shows the example of practicing e-learning in 'Kumamoto Internet Shiminjuku' and refers to the meaning and the possibility of e-learning use for lifelong learning."}
{"text":"Articles of Toshihiro Kita. Synchronization of Chaos in a Dual-structured System Consisting of Two Identical Piecewise-linear Systems. Synchronization phenomena of chaos observed in a dual-structured system is presented. The system is consisting of two identical piecewise-linear systems and the simple coupling between the two systems enables the synchronization of the chaotic behavior. An application of the proposed dual-structure to a real power system for the parameter value identification is also presented."}
{"text":"What is the web page address of the Moodle Kumamoto University? The web page address of the Moodle Kumamoto University is https://md.kumamoto-u.ac.jp/."}
{"text":"What is the address Center for Management of Information Technologies webpage? The address Center for Management of Information Technologies webpage is https://ewww.kumamoto-u.ac.jp/en/centers/centers/multimedia/ ."}
{"text":"What is the Center for Management of Information Technologies at Kumamoto? The Center for Management of Information Technologies was established as the central organization to organically integrate the university computer systems and info-communication networks."}
{"text":"How can I login in Moodle Kumamoto University? Visit the login page of the Kumamoto University  the Kumamoto University Integrated Authentication System. and type your Kumamoto University ID and password."}
{"text":"How to participate in lectures through e-learning at the Kumamoto University? Access Kumamoto University’s Portal website (http://uportal.kumamoto-u.ac.jp/)  and log on to"}
{"text":"Kumamoto University Portal’s Site by entering your Kumadai ID and password. Your Student number and password are written on the back of your Student ID."}
{"text":"Where can use the SOSEKI at the Kumamoto University? When you browse SOSEKI  please use the personal computer which is connected to Kumamoto University’s LAN. Accessing SOSEKI is available only in school."}
{"text":"Please list Toshihiro Kita's research while affiliated with Kumamoto University and other places.The publications of Kita Toshihiro can be found on the Research Gate https://www.researchgate.net/scientific-contributions/Toshihiro-Kita-82040055 ."}
{"text":"I am a student and I would like to study at the Kumamoto University.The Kumamoto University offers courses for international students. Please visit the webpage of the Kumamoto University International Students Office."}
{"text":"How can I send a message to Kumamoto University International Students Office? You can find Kumamoto University International Students Office on the Facebook."}
{"text":"Where are Toshihiro Kita's research publications? Toshihiro Kita's research publications are on this web page https://www.gsis.kumamoto-u.ac.jp/en/professors/toshihiro-kita/ ."}
{"text":"Does the Kumamoto University provides the 'e-Learning Station' program? Kumamoto University provides an e-Learning program for local citizens called as 'e-Learning Station'."}
{"text":"What is the mission of the Center for Management of Information Technologies (CMIT)? The mission of Center for Management of Information Technologies  is to use information technology to improve education and research at Kumamoto University. To achieve this  we research information processing  provide help with information-related research  and educate on information literacy. We also provide  operate  and maintain computer and network equipment at Kumamoto University. "}
{"text":"Toshihiro Kita. Professor, Instructional Systems. Born in Nara in 1967. Withdrew from his doctoral program with certification accredited by his academic advisor, of Graduate School of Engineering, Kyoto University. He served as an assistant professor in the Faculty of Engineering, Kumamoto University, associate professor at the Center for Multimedia and Information Technologies. Currently a professor at the Institute for e-Learning Development. Ph.D. in Engineering (Nagoya University, 2005). Fields of interest: e-learning systems, nonlinear systems, electronic music. Website: http://tkita.net"}
{"text":"Toshihiro Kita. Professor. Fields of interest: e-learning systems, nonlinear systems, electronic music. Website: http://tkita.net"}
{"text":"Toshihiro Kita. Professor. He served as an assistant professor in the Faculty of Engineering, Kumamoto University, associate professor at the Center for Multimedia and Information Technologies. Currently a professor at the Institute for e-Learning Development. Ph.D. in Engineering (Nagoya University, 2005). Fields of interest: e-learning systems, nonlinear systems, electronic music. Website: http://tkita.net"}
{"text":"About RCiS. The Research Center for Instructional Systems (RCiS) consists of three research divisions and a supporting division, the e-Learning Promotion Office, which aims to be a global research base for instructional systems research. We have various practical fields both inside and outside the university, and conducts researches for higher education and professional education."}
{"text":"Learning Support Information System Research Division. Kumamoto. Our department deals extensively with learning support using information systems, and aims to build systems that utilize ICT based on teaching methods for learning support. LMS (Learning Management System) is famous as an information system for learning support, but I do not think that learning support can be done with LMS. Examining the necessary teaching methods in the field of education, repeating theory and practice to determine whether the functions of the LMS can be used as part of the teaching system, or whether the functions of other information systems and information communication technology are effective. , I am researching the construction of a teaching system for collecting, processing, transmitting and using information necessary for learners' activities. Specifically, we are working on the following research. Use of interactive learning apps using VUI (Voice User Interface). Use of a system that aggregates SNS posts. Visualization of learning outcomes. Dashboard by mashup using WebAPI. LA (Learning Analytics). Inter-system linkage using standard technology"}
{"text":"Learning Support Information System Research Division. The use of an interactive learning app using VUI (Voice User Interface) and the use of a system that aggregates SNS posts are researches that support situations in which learners collect, process, transmit, and use information. Visualization of learning outcomes, mashup dashboards using WebAPI, and LA (LearningAnalytics) are research projects that support situations in which learners collect and use information. Standard technology is important in the effort to build a teaching system that uses various information systems and their functions. The standard technology LTI (Learning Tools Interoperability) links the LMS with other information systems necessary for learning, and the learning results are aggregated in the LMS. By using the standard technology IMS Caliper, the learning log becomes a unified record, and learning logs from other information systems and other LMS can be handled in a unified manner, making it possible to work on LA. In order to build a teaching system that involves complex information systems, we are researching inter-system cooperation using standard technology. We will continue to actively pursue research activities, focusing on the development and updating of tools and platforms for effective education in response to rapidly advancing technology."}
{"text":"A Discussion on Effective Implementation and Prototyping of Voice User Interfaces for Learning Activities on Moodle. Toshihiro Kita, Chikako Nagaoka, Naoshi Hiraoka, Katsuaki Suzuki, Martin Dougiamas. Research Center for Instructional Systems, Kumamoto University, Kumamoto, Japan. Moodle HQ, Perth, Australia. What is a VUI? A Voice User Interface (VUI) is a human-computer interface that allows people to use voice input to control computers and devices. It has a long history going back to the 1950s (Pearl,2016) During the last decade VUIs have quickly grown smarter thanks to evolving Natural Language Understanding (NLU) techniques, and have become well known through the spread of smart speakers, such as Amazon Echo and Google Home. Prototype of a VUI for Attempting Quizzes on a Moodle Site. Dialogfow (https://dialogfow.com/) was used for prototyping. Communication between Moodle and a smart speaker is done through Moodle web service API. Supports only multiple-choice questions. Currently works only with Google Home (for limited users). Learners are able to review their attempts on the Moodle site."}
{"text":"A Discussion on Effective Implementation and Prototyping of Voice User Interfaces for Learning Activities on Moodle Toshihiro Kita, Chikako Nagaoka, Naoshi Hiraoka, Katsuaki Suzuki and Martin Dougiamas Research Center for Instructional Systems, Kumamoto University, Kumamoto, Japan Moodle HQ, Perth, Australia Keywords: VUI, LMS, VLE, Chatbot, Artificial Intelligence, Smart Speakers, Voice Command, Hands Free Speaker. Abstract: Voice User Interfaces (VUI) are effective and intuitive for many people. The VUI is rapidly becoming suitable for various practical purposes using voice-operated smartphones, or smart speakers like Amazon Echo or Google Home. If VUIs, which may require less cognitive load to use, are available on learning management systems (LMS) like Moodle, they could enhance LMSs' functionality. This study demonstrates examples of existing educational applications for VUIs and chatbot interfaces. Design suggestions for VUIs for several Moodle activities are also described, and a prototype VUI for Moodle quizzes has been developed with the Dialogflow platform"}
{"text":"Introduction. Voice User Interfaces (VUIs) (Pearl, 2016), with which we can operate computers by voice, have greatly improved in recent years and have become usable for practical purposes in our daily life. VUI is an effective and intuitive user interface for many people. Thanks to improvements in the accuracy of speech recognition and synthesis using machine learning approaches, VUIs are rapidly becoming suitable for various practical purposes using voice-operated smartphones, or smart speakers like Amazon Echo or Google Home. Moodle (Moodle.org, 2017b) is one of the most popular Learning Management Systems (LMS) or Virtual Learning Environments (VLE) in the world. If VUIs, which may require less cognitive load to use, are made available on LMSs like Moodle and if welldesigned courses use them effectively, they could enhance the functionality of LMSs. VUIs are also very useful for blind learners. Though the final goal should be to enable all operation through a VUI on Moodle, it is meaningful to first discuss which Moodle activities are appropriate for VUI."}
{"text":"What is a VUI? A Voice User Interface (VUI) is a human-computer interface that allows people to use voice input to control computers and devices (Amazon.com, 2017h). It has a long history going back to the 1950s (Pearl, 2016), and during the last decade VUIs have quickly grown smarter thanks to evolving Natural Language Understanding (NLU) techniques, and have become well known through the spread of smart speakers, such as Amazon Echo and Google Home. Compared to inputting information by text, voice input has advantages (Pearl, 2016) of speed (faster than typing) hands-free use (usable even if you are doing something) intuitiveness (it works even if you are not familiar with technology) empathy (voice conveys more information than text messages). Especially in private spaces, VUIs may become as widely used as today's smartphones in the near future. Smart speakers are designed to be located at the center of a room and to always be ready to respond from wherever the user talks to it. Chatbot interfaces, which have much in common with VUIs, are similar to the text interface used by Facebook Messenger or Skype Instant Messaging, but the other side (whom you send your messages to) is a computer. In other words, a VUI is the voice version of a chatbot interface. The same development tools can be used for building both interfaces. The script for describing how a user and computer interact with is also almost the same, except that chatbot interfaces can display images and clickable hyperlinks, while VUIs can play sound at any intended timing."}
{"text":"VUI development tools. Tools and documents for building VUIs are found at the Amazon Alexa site (Amazon.com, 2017a) and the Actions on Google site(Google Developers, 2017a). Both are full of examples and templates to quickly start development of VUIs, including integration with external systems like Moodle. On Amazon Alexa, users can build and publish an Alexa Skill (an app for VUIs) that you can use on Alexa devices like Amazon Echo (Amazon.com, 2017d) smart speakers. With Actions on Google, users can build apps to use on Google Assistant devices like Google Home (Google, 2017) smart speakers."}
{"text":"Application examples of VUIs or chatbots to education There are several newly developed educational applications for VUIs, especially in online learning. An Alexa Skill called 'Canvas' (Amazon.com, 2017c; Moodlenews, 2017a) is a good example. With the Skill, users can quickly access information like grades, missing assignments, due dates, etc. on their Canvas LMS by speaking to Amazon Echo. Possible commands include 'What are my course grades?' 'Do I have anything missing?' or 'Do I have anything due this week?' Available commands for the Skill are listed on a Canvas Community page (Canvas, 2017). When users enable the Canvas Skill, they are required to link their Canvas account to their Alexa devices. Another Alexa Skill called 'My Blackboard for Blackboard Learn' (Amazon.com, 2017f; Moodlenews, 2017a) can connect to a user's school Blackboard account and the user's report grades and course announcements. This Skill requires some setup of the Alexa Connection link on the Blackboard system side. There is also a Moodle-related Alexa Skill called 'News for the Moodle.org Community' (Amazon.com, 2017g) for teachers and admins to listen to current Moodle.org announcements, forum posts, etc. This is a Flash Briefing Skill, meaning that users can listen to the information together with other news, assuming that the user has enabled it, when they ask Amazon Echo questions like 'Alexa, what's in the news?' The information provided by the Skill includes Moodle.org Announcements (Moodle updates and so on from Moodle HQ) Moodle.org recent forum posts Moodle.org Resources (recently updated Plugins, Moodle Jobs, etc.) and users can select which of these to hear in their Flash Briefing. With the Alexa app on a smartphone, users can see more information about each piece of Moodle news. A chatbot interface is like a VUI, as stated in Section 2. Compared to VUIs, there are more chatbots applications for education. One of the most famous chatbots for educational purposes is used at Georgia Tech's online master's of science (Maderer, 2016). They reported that students did not know their Teaching Assistant was a computer. A chatbot called 'FreudBot' teaches Freud's theory and concepts through chat (Heller et al., 2005). In their research, learners who experienced FreudBot were asked to rate the importance of chatbot applications in other areas. The results showed that a 'practice quizbot' and a famous personality chatbot like FreudBot were most desired. The last example in this section is for Moodle. Moodle Global search using a chatbot interface (Porritt, 2017; Moodlenews, 2017b) has recently been developed and demonstrated. The chatbot employs Natural Language Understanding and Amazon Rekognition (AWS, 2017). It recognizes images stored in a Moodle site so users can search for them by keyword even if the images do not have metadata or captions."}
{"text":"Possible Introduction of VUIs to Moodle Activities This section contains suggestions about which Moodle activities could be equipped with a VUI and how the VUI should be implemented for the activity, described mainly in the form of dialog examples. The following three examples of VUIs are just suggestions and have not actually been implemented (except for the subset of functionality shown in Subsection 5.1, which has been implemented as shown in Section 6), although they are feasible using current VUI development tools and the current version of Moodle. It is assumed that users have already linked (Google Developers, 2017b; Amazon.com, 2017e) their Moodle account to a VUI device for the following three examples."}
{"text":"Attempting Moodle Quizzes through a VUI Table 1 shows an example of how a learner attempts a Moodle Quiz through VUI. The flow of interaction begins with a 'welcome' phase, followed by a loop of 'question-answer' phases. When all the questions in the quiz have been asked and answered, the grade is spoken to the learner and the session ends. There are several possible uses for attempting quizzes via VUI. For example, before deciding to enroll in a course or at early stages of learning in a course, a 'trial quiz' via VUI may allow learners to quickly grasp what they will be able to learn, distinguish, and perform after completing the course. (The trial quiz must be designed to assess the required skills for the course and to engage learners' interest.) The intent is to get learners interested in the subject rather than to rigorously evaluate the learners' knowledge or skills. It may also be an incentive for less motivated learners to redevelop their motivation."}
{"text":"Moodle Lessons through a VUI for Simulation Learning Moodle Lesson (Moodle.org, 2017d) is good for roleplay simulations and decision-making exercises. Table 2 shows an example of a Moodle Lesson using a VUI. This is an example of simulation-based learning about what to do when an earthquake occurs. Depending on the situation that learners face, they can practice and learn skills by answering within a restricted amount of time via VUI. To evoke more realistic feelings in learners, it is better to play sound effects according to the situation by using sound files embedded in the Lesson pages. With this kind of integration, Moodle Lesson could also be a tool for building scripts or scenarios using VUI. If the scenario is complex enough (has a lot of branches) to simulate realistic problems, this will provide effective learning."}
{"text":"Notifications through a VUI to Assist Learners If learners can get information about their Moodle courses from smart speakers that they often use, then it may help them to plan and schedule their learning. Table 3 shows an example of this. The information provided through the dialog is basically the same as indicated on the Course Overview (Moodle.org, 2017a) and Upcoming Events blocks (Moodle.org, 2017c) that are displayed on the learner's Moodle Dashboard. To let the user easily select the information they want, a very simple menu ('You have two assignments and one quiz that are due, and one reply in the forum.') is spoken first, after which the user can interact with the VUI to gradually specify the desired information. The menu options should be repeated anytime that the user tries to select another piece of information. Various notification sounds according to the relative importance of the information could be effective for notifying learners. This would be a good way for learners to easily and quickly get information that they cannot miss if they are to keep learning."}
{"text":"Prototype of Moodle Quiz Attempting VUI We have developed a prototype of a VUI for Moodle Quizzes. Dialogflow(Dialogflow, 2017) (with the webhook feature) was used for prototyping. Communication between Moodle and the Dialogflow agent is done through the webhook script that is invoked by Dialogflow Intents (interaction rules between a user and agent). The webhook script is written in PHP and uses Moodle web service REST API (Moodle.org, 2016), such as 'mod quiz get quizzes by courses' or 'mod quiz start attempt'. The prototype supports multiple-choice questions, as shown in Figure 1, and is currently available through Google Home smart speakers (for limited users). Thanks to Dialogflow Integrations' features, it is also available through Facebook Messenger or other common messaging services that have a chatbot style interface. For the prototype system to work, the Moodle site settings 'Enable web services for mobile devices' and 'Enable web services' must be set to 'Yes.' The quiz-attempt interaction data is sent to and stored in the Moodle Quiz attempt history, so the learner is able to review the attempt on the Moodle site later. Figure 2 shows the prototype being tested using Actions on Google Simulator. It indicates how a learner (on the right side) attempts the quiz (Figure 1) on a Moodle site with responses from the agent (on the left side) linked to the Moodle site. Currently, the latter half of the dialog shown in Table 1 has been realized for the first Quiz instance in a fixed course for a fixed user."}
{"text":"Discussions and Conclusions A web article (Noble, 2016) suggests how chatbots could serve in education: Coaching (virtual coach that provides a knowledge base) Reference (helping people to find answers) Performance support (just-in-time learning and troubleshooting) Drill and practice (gamified learning to fill downtime) Cohorts and social learning (bots as moderators and experts in forums) Personalization (personalized interface with all learning resources) Most VUI examples described in Section 4 and our prototype described in Section 6 do not seem to fall clearly into the categories of purpose that Noble has suggested, because the examples are yet small and not so rich in user interactions. Overtime, however, the more intelligent and interactive applications of VUIs suggested by Noble are expected to appear. Optimal design is important for VUIs, just like e-learning materials. As pointed out in the design checklist (Amazon.com, 2017b), 'make it clear how customers can benefit from your skill' (e.g. clear definition of the learning goal) and 'watch customers try to use your skill' (e.g. formative evaluation) are very important. By prototyping the quiz VUI, we confirmed that our suggestions for implementing the quiz VUI are feasible and came to several conclusions. It is important for VUIs to always speak in short phrases. If it must be long, however, the VUI had better inform users of the total time first, because they will begin to wonder when it will end (for a GUI, it is not so hard to know the total size of the text materials, as we can recognize the size by just looking at them). Therefore, it is not a good idea to use existing content on an LMS without change for VUIs. Content often needs redesigning to make the most of learning through a VUI. A VUI on an LMS should be used not only to supply information or activities, but also to assist or asses learners in a natural manner. For that purpose, small talk between a learner and LMS would be effective and is already feasible using current Natural Language Understanding techniques. A VUI has the merit that learners 'feel heard' through conversation with the virtual agent (behind an LMS or something else) whose role is to assist learners. The interactions that learners experience are expected to positively affect their motivation. Based on the prototype VUI we have developed, we are going to implement VUIs for Moodle as suggested in this paper, and will improve them through evaluation at real educational sites. Feedback from readers of this paper is welcome."}
{"text":"Implementation of Voice User Interfaces to Enhance Users’ Activities on Moodle Toshihiro Kita Research Center for Instructional Systems Kumamoto University Kumamoto, Japan kita@rcis.kumamoto-u.ac.jp Chikako Nagaoka Research Center for Instructional Systems Kumamoto University Kumamoto, Japan cnagaoka@kumamoto-u.ac.jp Naoshi Hiraoka Research Center for Instructional Systems Kumamoto University Kumamoto, Japan naoshi@kumamoto-u.ac.jp Martin Dougiamas Moodle HQ Perth, Australia martin@moodle.org"}
{"text":"Abstract—Voice user interfaces (VUIs) are effective and intuitive to improve user interaction with various types of information-technology-based systems. VUIs are increasingly becoming suitable for use in various practical applications, e.g., voice-operated smartphones or smart speakers such as Amazon Echo or Google Home. If VUIs, which enable hands-free and intuitive use, become available to a learning management system (LMS) such as Moodle, learning activities on the LMS can be made easier and help motivate the users. In addition, if it is possible to search LMS help documentation by speech via a VUI and listen to the search results, the work efficiency of LMS content creators may be improved. In this research, we have developed a voice app for learners to attempt quizzes on Moodle sites, and a voice app for users to search MoodleDocs (Moodle online documents). Keywords—VUI, LMS, VLE, MoodleDocs, Smart Speakers, Voice Command, Hands Free Speaker"}
{"text":"Introduction Voice user interfaces (VUIs) allow people to use voice input to control computers and devices. VUIs have advantages over typing, such as faster input speed, hands-free use, and intuitive use [1]. Thanks to recent improvements in the accuracy of speech recognition and synthesis through machine learning approaches, VUIs are rapidly becoming suitable for various practical purposes in devices such as voice-operated smartphones and smart speakers like Amazon Echo or Google Home. Moodle [2] is a popular Learning Management System (LMS) used around the world. Moodle offers various features to perform learning activities, such as Quizzes and Assignments. Making these features available through a VUI could enhance the functionality of Moodle. Of course, VUIs are essential for blind learners. Apps using VUIs have been developed for several LMSs such as Moodle, which show the submission due dates of assignments or the score of users in courses. However, there are no apps that can be used to perform the learning activity itself via a VUI with an LMS, as far as the authors have examined [3]. Additionally, even if an LMS itself is not equipped with a VUI, searching the help documentation of an LMS by voice commands will be useful when operating the LMS for creating teaching materials, leading to improved operability of the LMS."}
{"text":"Development of Apps for Smart Speakers In this research, two popular services for smart speakers are utilized for development: Amazon and Google. Tools and documentation for building the VUIs are found for 'Amazon Alexa' [4] and for 'Actions on Google' [5], which contain several examples and templates for developers to get started quickly with VUI development, including integration of the VUIs with external systems. With Amazon Alexa, a cloud-based voice service, developers can build and publish Alexa Skills1 that can be used with Alexa devices such as Amazon Echo smart speakers. Actions on Google service, in contrast, are for building VUI applications for Google Assistant devices such as Google Home smart speakers. In this paper, Alexa Skills that can be used with Alexa devices such as Amazon Echo smart speakers, and applications for Google Assistant devices such as Google Home smart speakers, are collectively referred to as 'voice apps'. Google's Dialogflow [6] provides a voice app development environment based on 'Actions on Google' service. An 'intent' is a unit which defines how to respond when a user speaks. To define the response, a response string can be directly specified on Dialogflow. Alternatively, the user’s utterance data can be sent to an external service using 'webhook' [7] (Fig.1) for processing in order to obtain a response. The development environment called Alexa Developer Console [8] provided by Amazon Alexa has a structure similar to Dialogflow, but responses at an intent are not specified directly on the Alexa Developer Console. An external service (endpoint) must always be called to transmit a user’s utterance data and to obtain the result that becomes the response at the intent (Fig. 1)."}
{"text":"Attempting Quizzes through a VUI If oral quizzes on an LMS were to be available using a smart speaker placed at home, the learner could attempt the quiz questions more easily than with personal computers and smartphones, possibly triggering the user’s willingness to learn. For example, before enrolling in a course or in the early stages of learning in the course, if a 'trial quiz' (a quiz that can evaluate the skills to be learned and attract the attention of learners) is provided to learners through smart speakers, learners could quickly grasp what they will learn and what they will be able to do when they complete the course, stimulating their desire to learn. The voice app developed in this research, which allows students to take quizzes2 on Moodle using a VUI, is publicly available as a demonstration command [9]. Any users of Google Home or Google Assistant app can try the voice app by saying 'OK Google, talk to Moodle quiz.' For Amazon Echo, users can try the voice app by saying 'Alexa, open Moodle quiz' after enabling the 'Moodle quiz' Skill. The publicly available version of our voice app works with a fixed user logged in to the demo Moodle course, but the development version uses a feature to link accounts [10]–[12], enabling a connection to any Moodle site and the ability to take quizzes on it by storing the access token for the Moodle site. The connection between the voice app and Moodle is made possible using the Moodle web services API [13] as shown in Fig. 1. Users’ history of quiz attempts is stored on the Moodle site as usual and can be reviewed by each user. To allow learners to attempt quizes, the voice app uses the functions shown in Table I to communicate with Moodle via REST web services. These functions are provided by a vanilla version of Moodle, thus users do not need to install any special Moodle plugins to use the voice app. One of the difficulties we faced in the voice app development was that the data returned by each web service function are intended for displaying purposes, and were not directly usable as the voice app response. To retrieve question texts, or question answers, the question data in HTML format, whose structure was not explicitly documented, needed to be analyzed. Fig. 2 demonstrates the behavior of a Skill under development on Alexa Developer Console. The learner (right) is shown taking a quiz on Moodle. The score is mentioned and feedback is provided based on the learner’s answers. Currently the supported languages are English and Japanese. The user’s language can be set in the smart speaker settings and the Moodle preferences settings. If a quiz needs to support multiple languages based on the users’ language settings, quiz questions must be prepared using the format of the multilanguage content filter [14]."}
{"text":"Searching help documents by voice commands. From the viewpoint of online teaching material creators, LMSs like Moodle have many features. When creating teaching materials, it is often necessary to search and browse documentation about the operation methods and functions, which is bothersome and can hinder the utilization of LMSs. In this research, we developed a voice app with which users can search the help documentation of Moodle functions and can listen to the result using only voice commands. The voice app is designed to search Moodle help documentation created by translating English MoodleDocs [15] into Japanese3 using the Google Cloud Translation API (mistakes and deficiencies were corrected manually afterwards). MoodleDocs is one of the most popular Moodle online manuals, which is maintained by Moodle HQ. It covers all the features of Moodle and is used by many as a basic manual to refer to when using Moodle. Although there is already a Japanese version of MoodleDocs, like many other versions in other languages than English, the Japanse version is not as rich as the English version and does not cover, in particular, the new features of the latest version of Moodle. For this reason, it was necessary to translate all the pages of English version of MoodleDocs using the machine translation service. The original English MoodleDocs is built on the MediaWiki system, but the archived files [16] retrieved from the system were used for this translation. Voice apps are typically designed assuming that possible word candidates (personal names, date, city names, etc.) are used in a user’s utterance to obtain a part of the user’s utterance content as a parameter4 . However, this voice app needed search terms for searching a large number of documents, meaning that any words or phrases must be obtainable. Therefore, for the Alexa Skill, AMAZON.SearchQuery was used as the slot type (Fig. 3), and for the intent on Dialogflow, sys.any entity was used (Fig. 4). Responses must be limited to the amount of information that is necessary and sufficient in order to accurately convey the search results by voice. In addition, a function capable of displaying images and text information in a visual format can also be implemented. From this standpoint, additional improvements could be made to produce an even more userfriendly voice app."}
{"text":"Conclusions In this research, we developed functions to take quizzes on a Moodle site and to search LMS manual documentation via a VUI in order to enhance user activities. Although there are currently few examples of LMSs equipped with VUIs, it is considered worthwhile to practically explore the use value of VUIs as a new channel that strengthens the interaction between LMSs and the users. Implementing a VUI as a user interface requires consideration of how to capitalize on the advantages while being aware of the limitations and drawbacks of a VUI. Our future plan includes extending the voice app to be able to notify learners and teachers of important activities (such as due or overdue assignments) to support their learning and teaching on Moodle. One possible method is to add web service API support to the Timeline block [17] and a notification feature to the voice app. In addition, more intelligent and proactive support for users can be implemented by importing insight results of Moodle Analytics engine [18]. The authors have joined another research project on implementing a safety education system based on Moodle that is aimed at preventing serious accidents. The VUIs we are developing are expected to play an important role in achieving these aims."}
{"text":"Kumamoto University, located in the city of Kumamoto in Japan, is composed of three main campuses. The history of the Kumamoto University Hospital goes back to the opening of the Hosokawa Clan Hospital in 1870. After being reorganized and moved several times, the hospital was moved to the place where it is currently located in 1901. In order to meet the needs of the segmentation and advancement of medical services, the hospital established central consultation facilities as well as new medical departments with the aim of doing such things as increasing efficiency. Currently, the Kumamoto University Hospital has developed into a general hospital with high-tech medical equipment and a comprehensive medical system. Kumamoto University, which is located in the city of Kumamoto in Japan, is composed of three main campuses, which are the Kurokami Campus, the Honjo and Kuhonji Campuses, and the Oe Campus. Walking around the Kurokami North Campus, one encounters several nostalgic structures made with red brick, such as the Fifth High School Memorial Hall, the Science Experiment Site, and 'Akamon' (the 'Red Gate'). These elegant structures are important national cultural assets that date back to the beginning of Kumamoto University. On the Kurokami South Campus there are several new buildings, the 12-floor Center for Kurokami Advanced Research Alliance, high-rise buildings complete with experimental test facilities and research rooms, and the Faculty of Engineering's 100th Anniversary Memorial Hall. Due to their size, these impressive buildings dominate the local skylines."}
{"text":"The university campus is a pleasing mix of buildings that reflect both the past and present of the university. Kumamoto_University1The IT Environment at Kumamoto University is quite excellent and is equipped with an extensive LAN (Local Area Network) that provides system programs for use by faculty and students. The LAN can handle data transfer at a rate of 24 gigabytes per second. The Kumamoto University Campus Information System, which is commonly known as SOSEKI, allows members of the Kumamoto University community to search and browse information on academic affairs without regard to time of day or location. Recreation at Kumamoto University There are 44 varsity sports teams and 34 cultural clubs that are officially recognized by the university. All of them are run by the students themselves. One can see students energetically participating in these activities every day at such places as the gym, the athletic field, and the student union building. International Relations at Kumamoto Univeristy Kumamoto University has been promoting the establishment of overseas offices in response to the globalization of the university's educational and research activities. In October 2007, the university opened its first overseas office in Shanghai, China and employed a full-time Chinese staff as an international relations coordinator dealing with various projects through cooperation with the International Affairs Section of the university in Kumamoto, Japan, including cultivating potential Chinese students for the university, expanding and strengthening academic relationships with partner universities and institutions in China, promoting collaboration with industries and governments in China, networking Japanese and Chinese alumni in China and adopting a serious public relations stance in China. Furthermore, the university has been currently discussing establishing its second overseas office in Daejeon, Korea. The new office will be located within the campus of the Korea Advanced Institute of Science and Technology (KAIST) as the university’s Korean Office to promote its research collaboration base with KAIST. Kumamoto University and KAIST concluded an academic and student exchange agreements in 2006."}
{"text":"History of Kumamoto University. The university started accepting government-sponsored international exchange students around 1960, but records indicate that several international exchange students studied in the Faculty of Medicine as early as the 1950s. It is since the 1960s, though, that the number of international students has been steadily increasing. By 1984, there were approximately 50 international students at the university, and that number increased to over 300 by 2004. Since Kumamoto University became a National University Corporation in 2004, the university has been ushering in an era of change. Despite the changes, the university will continue to strive for further advancements in education, research, and medical care based on the knowledge and experience it has gained since it was first established in order to contribute to society in the 21st century."}
{"text":"Kumamoto University. Main Campus, Kurokami South Campus 2-39-1 Kurokami, Chuo-ku, Kumamoto-shi, 860-8555, Kumamoto."}
{"text":"Kumamoto University. Kurokami North Campus, 2-40-1 Kurokami, Chuo-ku, Kumamoto-shi, 860-8555, Kumamoto."}
{"text":"Kumamoto University was founded in 1949 as a national university. We seek to cultivate an open mind with a broad view, a creative imagination, the ability to solve problems, and the aptitude to communicate internationally. School Address: 2-39-1 Kurokami Chuo-ku Kumamoto, 860-8555 JAPAN, 2-40-1 Kurokami Chuo-ku Kumamoto, 860-8555 JAPAN, 1-1-1 Honjo Chuo-ku Kumamoto, 860-8556 JAPAN, 2-2-1 Honjo Chuo-ku Kumamoto, 860-0811 JAPAN, 4-24-1 Kuhonji Chuo-ku Kumamoto, 862-0976 JAPAN Tel: 096-342-2108, www.kumamoto-u.ac.jp/en/"}
{"text":"Professor Toshihiro Kita. Education. 2005 Nagoya University Graduate School, Division of Engineering (dissertation submission), 1993 - 1996 Kyoto University Graduate School, Division of Engineering, 1991 - 1993 Kyoto University Graduate School, Division of Engineering, 1987 - 1991 Kyoto Univesity Faculty of Engineering."}
{"text":"Toshihiro Kita. Professional career. Master of Engineering(Kyoto University). ph.D.(Nagoya University). Hobby electronic music."}
{"text":"Toshihiro Kita Professor. Works. Learning support systems, Electrical power engineering. Research on Adaptive Learning System Using Big Data of Learning Log in Higher Education. 2019 - 2022 Implementation of a safety education system based on an active LMS to prevent serious accidents that could be prevented by education. 2017 - 2020 A Study of Learning Support System Using Blockchain for Learners in Developing Countries."}
{"text":"How do I upload an assignment? In your course  click on the assignment. Click the Add submission button  and then upload your file."}
{"text":"I can't I log in. There could be many reasons but the most probable is you have simply forgotten your password or username  are trying the wrong one or are entering it incorrectly. Does your username or password contain upper and lower case letters? "}
{"text":"Why can't I log in? There could be many reasons but the most probable is you have simply forgotten your password or username  are trying the wrong one or are entering it incorrectly. Some other things: does your username or password contain upper and lower case letters?  The Y and Z swapped on Hungarian keyboard compared to the English."}
{"text":"How do I gain access to a course? Locate or search for the desired course (you can click 'All courses... ' in the 'My courses' block) and click on the course name. If your teacher has given you an enrollment key  enter it when prompted  and click Enroll me in this course. Once you are enrolled in a course  it will appear under 'My courses' or in 'Course overview' any time that your are logged into that Moodle site."}
{"text":"Can the teacher enroll me in the course? The teachers can enroll students to their courses manually if the student has already logged in the Moodle portal."}
{"text":"How do I jump between my courses? Use the 'My Courses' or 'Course overview' features."}
{"text":"How do I get back to the homepage? Use the navigation bar at the top of the page or the menu."}
{"text":"How do I find a course? Type the name of the course in the 'Search courses' text field and click the 'Go' button."}
{"text":"Why am I not getting any e-mails and others are? Chances are your email address in your profile is either wrong or disabled. It could also be that you are not subscribed to the forums that are generating emails."}
{"text":"How can I stop the Moodle e-mails? E-mails are an essential part of the way Moodle works. They are used to keep you up to date with what is going on. If you wish to reduce the amount of emails you get you could edit your profile and change your e-mail settings unsubscribe from non-essential forums."}
{"text":"Why is there no upload box in Assignment? This is either because: the assignment has now closed  the assignment is not yet open or you already uploaded something and the settings prevent resubmissions."}
{"text":"How can I see my recent Assignment feedback? The most common method is by simply going to the same place where you uploaded the work or you can follow the link in the recent activity block (if the teacher has included it on the course)."}
{"text":"Why is my course average so low? Don't panic! The Moodle gradebook takes into account unmarked and unsubmitted work. In other words  you start with zero and as you progress through the course and complete graded activities the percentage will steadily rise."}
{"text":"What is Moodle? Moodle stands for Modular Object-Oriented Dynamic Learning Environment. It is an open source Learning Management System (LMS) which provides a simple  easy-to-use set of tools for creating web pages and to use those pages to deliver information and learning activities. "}
{"text":"What browser should I use? Google Chrome and Firefox are the recommended Internet browser for Moodle. It is very likely you will encounter problems if using Internet Explorer or Safari."}
{"text":"My teacher says to go on Moodle  but I do not see his course under 'My Courses'.Two possibilities: your teacher may not have made the course site available (visible) to students yet. Check with your teacher to ensure the course site is set to visible. You have not been enrolled in the course site."}
{"text":"How do I check my grades? In the Navigation block  click on Grades. From there  you can click on the name of any assignment completed  review your attempt(s)  and view any comments."}
{"text":"I can't see a block my instructor says is there  where is it? It is possible that you accidentally 'docked' this block. If there is a white bar on the side of your screen  hover over it and any blocks you have docked will pop-out. To 'undock' a block  click the little arrow icon. Or  to undock all blocks  click the little arrow in the lower-left corner of your screen. "}
{"text":"How do I use Moodle? Users  both students and teachers  access Moodle via a web browser on any platform (PC  Mac  mobile devices  etc.) with Internet access."}
{"text":"What if I do not have an Internet Service Provider? Access to the Internet is provided when you are on campus. You can use the Eduroam wifi network. For more information visit the https://eduroam.unideb.hu/ portal."}
{"text":"What is the Eduroam wifi network? Eduroam (education roaming) is the secure  world-wide roaming access service developed for the international research and education community. Eduroam allows students and teachers to obtain Internet connectivity across campus by simply opening their mobile device."}
{"text":"How do I navigate within Moodle? Moodle is organized as a web page per course  with a front greeting page. There are generally three columns on a page: the left and right columns generally offer automatically-generated information  with the large middle column used for the course content prepared by your teacher."}
{"text":"Where can I find help in Moodle? When the browser cursor hovers over something clickable  you will see an informative box pop up to confirm what clicking there will perform."}
{"text":"How do I enter in the course? You enter a course by finding its listing at the left of the screen  under My Courses  and clicking on the name. If you do not see your course listed  ask your teacher if they have made the course available to students."}
{"text":"Can I use the browser's forward and back buttons? Your browser's forward and back buttons sometimes work  but the using is not recommended when you are filling a form or quiz! You should use the links  the locator sequence (breadcrumb trail) (Dashboard / Courses / Faculty) near the top of your screen."}
{"text":"Should I logout when I finished? When you are finished  please click on Logout and  if you want to hide your username from the next user of that browser  exit the browser."}
{"text":"Moodle won't let me log in. What could be the problem? The system is case sensitive. Make sure the CAPS LOCK key is off. If your problem persists  please contact Moodle support sjsenta@kumamoto-u.ac.jp."}
{"text":"What can I do when my web browser doesn't work right with Moodle? We recommend using the Google Chrome  Firefox or Safari browser on both PC and Mac. Remember that mobile and desktop browsers are different."}
{"text":"A specific Moodle course doesn't list under My Courses. What is wrong? If you logged in successfully   but a specific course is not listed  it is probable that your teacher has not made the course available on Moodle yet."}
{"text":"Can I bookmark a course and access the course from the bookmark? Yes  you will be asked to login but then you will be placed at the bookmarked page."}
{"text":"Are there any restrictions on the names of files that I upload or attach to Moodle? Mostly no. Moodle does seem to have difficulty with punctuation so we recommend removing apostrophes and similar punctuation."}
{"text":"I am getting disconnected while taking a quiz. What is wrong? Many Internet Service Provider's drop a user if they detect no activity for a certain amount of time. Unfortunately this can occur when you are taking a quiz  because the time spent without any interaction with the Moodle is considered idle time by the ISP. You can use a computer with cable connection at the campus or you can generate network activity at various intervals by pressing the Save without submitting button."}
{"text":"I am getting disconnected while taking a quiz. Can I continue the quiz? Yes  if a disconnect does occur  you may reconnect to Moodle and re-enter the quiz. You will receive a Continue the last attempt?  prompt if you have resumed the quiz within the allowed time to complete the quiz."}
{"text":"Can I control the feedback I get while taking an online quiz? No  because the teacher chooses when  if  and how to provide feedback when (s)he designs a test."}
{"text":"How do I check grades? You should click on Grades to see your grades in the current course  provided that the teacher allowed viewing of grades in the course Settings. Also  email may be sent to you when a grade or comment is applied to your assignment or workshop submission."}
{"text":"Can I send email to other students in my course? The email sending options are set centrally on the Moodle portal."}
{"text":"Can I send messages to other students in my course? The messaging options are set centrally on the Moodle portal."}
{"text":"Moodle is sending me too much email! How can I fix this? Moodle does email forum postings to all subscribers. You can modify this behavior (when permitted by the forum's settings) by editing your user profile."}
{"text":"What online sources are available? The Moodle itself has contextual help popups  indicated by a yellow circled question mark; click on this icon to receive help."}
{"text":"Who do I contact for local support? If you have any problem with accessing a particular course or you have questions about quizzes or other elearning material  please ask for the teacher of the course  he can enroll you in  the course. The teacher can help in the educational affairs. For administrative support  send email to 'sjsenta@kumamoto-u.ac.jp'."}
{"text":"How do I find my course in Moodle? Once the instructor is ready to share the materials  he will make it available to students. There are a number of ways to locate the courses. The most direct is your Dashboard. You can use the 'My courses' list or the 'My courses' section and the 'Search courses' text box."}
{"text":"How do I self-enroll or use an enrollment key for a course? Some courses in Moodle are self-enrollment enabled. This way  if you have the enrollment key  you can manually add yourself to the course."}
{"text":"I’ve received an 'Invalid JSON string' error. What do I do? An invalid JSON error can occur for many reasons. The most common issue is usually associated with a file upload attempt  and can occur when: attempting to upload a file with the same name as another already-uploaded file upload a file that is too large  upload a file type that the system doesn’t recognize or upload a file with a period or special characters in the file name."}
{"text":"Is there a mobile app for Moodle? Yes  the Moodle offers a mobile app  you can install it on your mobile device. Remember that mobile app and desktop browsers are different."}
{"text":"How long can I access a Moodle course? Many Moodle courses are only available for one semester. Please remember  at the end of the semester  to back up your grades on your PC!"}
{"text":"How to access  complete and submit a quiz.Make sure you know when you should take the quiz. If your quiz is timed  make sure you set aside the time needed to complete the quiz in a single sitting. The timer will continue to count down even if you close the quiz or lose internet connection. Make sure you have a suitable device to use to complete the quiz. You will need to use a desktop computer or a laptop. Do not use a mobile device. Check if you are required to answer the questions sequentially (in order) or not."}
{"text":"How do I gain access to a course? Locate or search for the desired course (you can click 'All courses...' in the 'My courses' block) and click on the course name. If your teacher has given you an enrollment key  enter it when prompted  and click Enroll me in this course. Once you are enrolled in a course  it will appear under 'My courses'."}
{"text":"How do I jump between my courses? 'My Courses' block if it has been added to the page you are on Go back to the homepage and then use the main course block (if it has been added!)"}
{"text":"How do I get back to the homepage? Use the navigation bar at the top left of the page."}
{"text":"Why is there no Assignment upload box? This is either because: the Assignment has now closed  the Assignment is not yet open or you already uploaded something and the settings prevent resubmissions"}
{"text":"Which button do I press when I have finished a quiz? Click on 'Submit all and finish' button."}
{"text":"How to submit an Assignment? A Moodle assignment activity is where your instructor records your grade and provides feedback on your work."}
{"text":"If the Internet connection is lost during an exam  how does that affect the quiz? If Moodle detects that the student's Internet connection has dropped  and the Quiz autosave feature is enabled  a warning message is displayed  prompting the student to make a note of recent responses. "}
{"text":"How students review a quiz? What exactly they will see depends on the quiz settings the teacher choose for review."}
